0/epsilon
 /*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1453;//261100.26799;//14.855;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;//uniform 14.855;
    }
    OUTLET_4
    {
        type            zeroGradient;
    }
    OUTLET_3
    {
        type            zeroGradient;
    }    
    OUTLET_2
    {
        type            zeroGradient;
    }    
    OUTLET_1
    {
        type            zeroGradient;
    }
    WALL_TANK
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;//uniform 14.855;
    }
    WALL_INLET_CHANNEL
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;//uniform 14.855;
    }
    SIDE_4
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;//uniform 14.855;
    }
    SIDE_3
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;//uniform 14.855;
    }
    SIDE_2
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;//uniform 14.855;
    }    
    SIDE_1
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;//uniform 14.855;
    }
    WALL_CHANNEL_4
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;//uniform 14.855;
    }
    WALL_CHANNEL_3
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;//uniform 14.855;
    }
    WALL_CHANNEL_2
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;//uniform 14.855;
    }
    WALL_CHANNEL_1
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;//uniform 14.855;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
